import React from "react";
import { useRouter } from "next/router";

const logo = new URL("../../assets/LogoHorizontal.png", import.meta.url);

const Privacy = () => {
  const router = useRouter();

  const handleGo = () => {
    router.push("/");
  };

  return (
    <div className="m-12">
      <img src={logo} alt="Лого" width={250} className="mx-auto mb-12" />
      <div className="flex justify-start gap-20">
        <h2 className="text-blue-500 text-center font-bold text-xl">
          Үйлчилгээний нөхцөл
        </h2>
        <div className="text-justify">
          <div className="font-bold">Нэг. Ерөнхий нөхцөл</div>
          <div className="mb-4">
            1.1. Энэхүү Advance MN Аппликейшний үйлчилгээний нөхцөл (цаашид
            “Үйлчилгээний нөхцөл”гэх )-ийн зорилго нь “Эдванс кредит ББСБ” ХХК
            (цаашид “ББСБ” гэх)-ийн дэвшилтэт технологийн шийдэл бүхий “Advance
            MN” аппликейшнээр дамжуулан Харилцагчийг таньж баталгаажуулах,
            Харилцагчийн зөвшөөрлийг цахим хэлбэрээр авах, бүртгэл үүсгэх, банк
            бус санхүүгийн үйлчилгээний нөхцөлийг санал болгох, үйлчилгээ
            үзүүлэхтэй холбоотой харилцааг зохицуулахад оршино. Энэхүү
            Үйлчилгээний нөхцөл нь Харилцагч уг нөхцөлийг сайтар уншиж танилцан
            баталгаажуулах буюу зөвшөөрсөний үндсэн дээр хэрэгжих, хууль эрх
            зүйн хувьд хүчин төгөлдөр баримт бичиг юм.
          </div>
          <div className="font-semibold">Зөвлөмж:</div>
          <div className="mb-4">
            Харилцагч та энэхүү үйлчилгээний нөхцөлтэй сайтар танилцаж,
            зөвшөөрөх эсэхээ шийдэхийг зөвлөж байна. Та доод хэсэгт байрлах
            “Зөвшөөрөх” товчлуурыг дарснаар уг үйлчилгээний нөхцөлийг хүлээн
            зөвшөөрч, баталгаажуулсан гэж үзнэ.
          </div>
          <div className="font-bold">Хоёр.Үйлчилгээний тайлбар</div>
          <div className="mb-4">
            2.1 ББСБ нь харилцагчийн гаргаж өгсөн мэдээллийг Харилцагч
            Үйлчилгээний нөхцөлтэй танилцаж, баталгаажуулсаны дараа Харилцагчийг
            танин баталгаажуулах, түүний бүртгэлийг үүсгэх, банк бус санхүүгийн
            үйлчилгээний нөхцөлийг санал болгох, зээлжих чадварыг тодорхойлох,
            санхүүгийн үйлчилгээ үзүүлэх, гэрээ байгуулсан тохойлдолд тухайн
            гэрээний үүргийн гүйцэтгэлийг хангуулах, Харилцагчид тохирсон
            үйлчилгээг санал болгох, ББСБ-ын бүтээгдэхүүн үйлчилгээний
            мэдээллийг хүргүүлэх зорилгоор цуглуулж, боловсруулж, ашиглана.
          </div>
          <div className="font-semibold">Санамж:</div>
          <div className="mb-4">
            Харилцагч нь энэхүү Үйлчилгээний нөхцөлийг хүлээн зөвшөөрч
            баталгаажуулсаныг ББСБ-д өөрийн мэдээллийг цуглуулах, боловсруулах,
            ашиглуулахыг зөвшөөрсөнд тооцох тул зөвшөөрөхгүй тохиолдолд Advance
            MN аппликейшнийг ашиглахгүй байхыг зөвлөж байна.
          </div>
          <div className="mb-2">
            2.2 Харилцагчийн гаргаж өгсөн мэдээллийн хаяг, байршил, иргэний
            бүртгэлийн дугаар, хөрөнгө, санхүүгийн мэдээлэл, боловсрол, цахим
            тодорхойлогч, цахим баримт бичиг, хүнийг шууд болон шууд бусаар
            тодорхойлох, эсхүл тодорхойлох боломжтой бусад мэдээлэл (зарим
            тохиолдолд хүний эмзэг мэдээлэл),
          </div>
          <div className="mb-2">
            2.2.1 Харилцагчийн өөрийн гэр бүлийн гишүүдийн халдашгүй, чөлөөтэй
            байх эрхийг зөрчихгүйгээр гаргаж өгсөн мэдээлэл,
          </div>
          <div className="mb-2">
            2.2.2 Танилт нэвтрэлтийн нэгдсэн систем /ДАН/, Төрийн мэдээлэл
            солилцооны систем /ХУР/ дэх мэдээлэл, Зээлийн мэдээллийн сангийн
            мэдээлэл,
          </div>
          <div className="mb-4">
            2.2.3 Харилцагчийн Advance MN аппликейшнийг ашиглаж буй төхөөрөмжийн
            мэдээлэл (цаашид эдгээрийг “Мэдээлэл”-гэх).
          </div>
          <div className="mb-4">
            2.3 ББСБ нь Харилцагч Мэдээллийг устгах хүсэлт гаргах хүртэл
            хугацаанд боловсруулж, ашиглана. Харин гэрээ байгуулсан тохиолдолд
            тухайн гэрээний дагуу хүлээх үүрэг бүрэн дуусгавар болох хүртэл
            хугацаанд Мэдээлэл устгах хүсэлт гаргах боломжгүй юм.
          </div>
          <div className="mb-4">
            2.4 ББСБ нь таны зөвшөөрөлгүйгээр Мэдээллийг нийтэд ил болгохгүй.
          </div>
          <div className="mb-4">
            2.5 ББСБ нь Банк бус санхүүгийн үйл ажиллагааны үйлчилгээг
            сайжруулах зорилгоор гуравдагч этгээдэд дамжуулж болно.
          </div>
          <div className="mb-4">
            2.6 Харилцагч өөрийн олгосон зөвшөөрлийг цуцлах тохиолдолд цуцлах
            тухай хүсэлтээ бичгээр гаргах бөгөөд ББСБ-ын дээрх хаягт хүргүүлнэ.
          </div>
          <div className="mb-2">
            2.7 Та “Advance MN” аппликейшнд хувийн болон санхүүгийн мэдээллээ
            үүсгэхдээ дараах үүргийг хүлээнэ:
          </div>
          <div className="mb-2">2.7.1 Хуурамч мэдээлэл оруулахгүй байх</div>
          <div className="mb-4">
            2.7.2 Бусдын хувийн болон санхүүгийн мэдээллийг оруулахгүй байх
          </div>
          <div className="mb-4">
            2.8 Хэрэв Та энэхүү Үйлчилгээний нөхцөлийн “2.8.1”-д заасныг зөрчин
            хуурамч мэдээлэл оруулсан бол “Эдванс кредит ББСБ” ХХК таны зээлийн
            хүсэлтийг хянах, Зээлийн гэрээ байгуулахаас татгалзах эрхтэй.
          </div>
          <div className="mb-4">
            2.9 Хэрэв та энэхүү Үйлчилгээний нөхцөлийн “2.8.2”-т заасныг зөрчин
            бусдын нэр, хувийн болон санхүүгийн мэдээллийг ашигласан, эсхүл
            дамжуулсан бол “Эдванс кредит ББСБ” ХХК таны зээлийн хүсэлтийг хянах
            болон Зээлийн гэрээ байгуулахаас татгалзах эрхтэй бөгөөд Та өөрийн
            хууль бус үйлдлийн улмаас тухайн мэдээллийн өмчлөгч, эзэмшигч,
            “Эдванс кредит ББСБ” ХХК
          </div>
          <div className="mb-4">
            2.8 Хэрэв Та энэхүү Үйлчилгээний нөхцөлийн “2.8.1”-д заасныг зөрчин
            хуурамч мэдээлэл оруулсан бол “Эдванс кредит ББСБ” ХХК таны зээлийн
            хүсэлтийг хянах, Зээлийн гэрээ байгуулахаас татгалзах эрхтэй.
          </div>
          <div className="mb-4">
            2.10 Харилцагч нь өөрийн Мэдээлэл болон ХХХ аппликейшн руу нэвтрэх
            нэр, нууц үг, нууц кодыг хадгалах, хамгаалах үүрэгтэй бөгөөд ХХХ
            аппликейшнийг ашиглах хугацааны аюулгүй байдлыг бүрэн хангах
            үүрэгтэй. Харилцагч өөрийн Мэдээлэл болон ХХХ аппликейшн руу нэвтрэх
            нэр, нууц үг, код зэргийг алдсан тохиолдолд ББСБ-ыг Харилцагчийн
            Мэдээллийг задруулсан тохиолдол гэж үзэхгүй бөгөөд үүнтэй
            холбогдуулан Харилцагчид, эсхүл гуравдагч этгээдэд хохирол учирсан
            тохиолдолд тухайн хохирлыг ББСБ хариуцахгүй болно.
          </div>
          <div className="mb-4">
            2.11 “Эдванс кредит ББСБ” ХХК нь Таны мэдээллийн аюулгүй байдлыг
            хангах, Advance MN аппликейшнийг зүй бусаар, эсхүл хууль бус
            зорилгоор ашиглахаас урьдчилан сэргийлэх зорилгоор аппликейшнд
            хандах хандалт, таны хийж байгаа аливаа үйлдлийн түүхийг лог болгон
            хадгалах, түүнийг хуулийн хүрээнд ашиглах эрхтэй.
          </div>
          <div className="font-bold">
            Гурав. ББСБ-ын үйлчилгээний нөхцөл, гэрээ байгуулах
          </div>
          <div className="mb-4">
            3.1 Та Advance MN аппликейшнаар дамжуулан зээл авах боломжит хэмжээг
            тогтоолгох, эрхийн хэмжээнд багтаан зээл авах хүсэлт гаргах, зээлийн
            гэрээг байгуулах, зээл авах, зээлээ төлөх, уруумшууллын оноо
            цуглуулах зэрэг ББСБ-аас үзүүлж буй үйлчилгээтэй холбоотой
            үйлдлүүдийг хийх боломжтой.
          </div>
          <div className="mb-4">
            3.2 Харилцагч нь ББСБ-тай Үйлчилгээ үзүүлэх ерөнхий гэрээ (цаашид
            “Ерөнхий гэрээ”гэх )-г байгуулсан тохиолдолд Advance MN
            аппликейшнийг ашиглаж санхүүгийн үйлчилгээ авах нөхцөл бүрдэнэ.
            Ерөнхий гэрээг ББСБ-ын аль ч салбарт хандаж байгуулж болох ба Мөнгө
            угаах болон терроризмыг санхүүжүүлэхтэй тэмцэх тухай хуульд заасны
            дагуу Харилцагчийг танин баталгаажуулахад заавал Харилцагчийн хүчин
            төгөлдөр иргэний үнэмлэх, эсхүл гадаад паспорт болон холбогдох бусад
            баримт бичгийг авч ирэх шаардлагатай. Харин өмнө нь ББСБ-тай Цахим
            зээлийн эрх нээх гэрээ байгуулсан Харилцагчийн хувьд энэхүү
            Үйлчилгээний нөхцөлтэй танилцаж баталгаажуулсанаар Advance MN
            аппликейшнийг ашиглах нөхцөл үүснэ.
          </div>
          <div className="mb-4">
            3.3 Харилцагчийн Ерөнхий гэрээ, эсхүл Цахим зээлийн эрх нээх гэрээ,
            эсхүл Харилцагчаар бүртгүүлэх маягтыг баталгаажуулахад ашигласан
            гарын үсгийн маягийг Харилцагчийн цахим гарын үсэг буюу баталгаат
            гарын үсэг (цаашид “Цахим гарын үсэг”гэх)-т тооцно.
          </div>
          <div className="mb-4">
            3.4 Харилцагч Advance MN аппликейшнаар дамжуулан авах зээлийн гэрээг
            Цахим гарын үсгээр, эсхүл нууц үг, нууц код, тоон гарын үсгээр
            баталгаажуулсныг гэрээ байгуулагдсанд тооцно.
          </div>
          <div className="mb-2">
            3.5 ББСБ нь Advance MN аппликейшнаар дамжуулж дараах бүтээгдэхүүн
            Үйлчилгээг Харилцагчид санал болгоно. Үүнд:
          </div>
          <div className="mb-4">3.5.1 Цахим зээл</div>
          <div className="mb-2">
            3.6 Advance MN аппликейшнаар дамжуулан дараах үйлдлүүдийг хийх
            боломжтой. Үүнд:
          </div>
          <div className="mb-2">
            3.6.1 Үйлчилгээний нөхцөлтэй танилцах, нөхцөлийг баталгаажуулах,
          </div>
          <div className="mb-2">3.6.2 Бүртгэл үүсгэх</div>
          <div className="mb-2">
            3.6.3 ББСБ-ын бүтээгдэхүүн үйлчилгээний нөхцөлтэй танилцах, мэдээлэл
            авах
          </div>
          <div className="mb-4">
            3.6.4 Боломжит зээлийн хэмжээг тогтоолгох, цахим зээл авах хүсэлт
            гаргах, зээл авах, зээлийн мэдээллийг харах, зээлээ төлөх
          </div>
          <div className="mb-4">
            3.7 ББСБ нь Харилцагчид бүтээгдэхүүн үйлчилгээний нөхцөл болон
            үзүүлж буй үйлчилгээтэй холбоотой мэдээллийг Advance MN аппликейшн,
            www.Advance.mn веб хуудас, бүртгүүлсэн электрон шуудан, утас, гэрийн
            хаяг зэрэг сувгуудаар мэдээлэл хүргүүлнэ. Эдгээр сувгуудаар мэдээлэл
            хүргүүлснийг Харилцагчид албан ёсоор хүргүүлсэнд тооцно.
          </div>
          <div className="mb-4">
            3.8 Та энэхүү Үйлчилгээний нөхцөлийг зөвшөөрч, Advance MN
            аппликейшнийг ашигласан нь Та болон “ Эдванс кредит ББСБ” ХХК-ийн
            хооронд зээлийн гэрээ байгуулсан, эсхүл “ Эдванс кредит ББСБ” ХХК
            танд зээл олгох амлалт өгсөн, гэрээ байгуулах санал гаргасан, эсхүл
            уг саналыг хүлээн зөвшөөрсөн гэж үзэх үндэслэл болохгүй бөгөөд “
            Эдванс кредит ББСБ” ХХК-н төв салбар дээр өөрийн биеэр ирж, Ерөнхий
            гэрээ байгуулснаар Advance MN аппликейшнийн үндсэн хэрэглэгч болж
            зээл авах эрх үүснэ. Түүнчлэн энэхүү Үйлчилгээний нөхцөл нь уг
            нөхцөлд тусгайлан дурдсанаас бусад асуудлаар “ Эдванс кредит ББСБ”
            ХХК-н ямарваа нэгэн шаардлага гаргах эрхийг танд олгохгүй болно.
          </div>
          <div className="font-bold">Дөрөв. Асуудал шийдвэрлүүлэх</div>
          <div className="mb-4">
            4.1 Харилцагч нь ББСБ-н үйлчилгээтэй холбоотой аливаа санал, хүсэлт,
            гомдлыг 88867736 Утсаар гаргана.
          </div>
          <div className="mb-4">
            4.2 Үйлчилгээний тасалдал нь байгалийн давагдашгүй хүчин зүйл(гал,
            үер, газар хөдлөлт, аянга болон тэсрэлт) эсвэл төрийн эрх бүхий
            байгууллагаас гаргасан хуулийн зохицуулалт, журам, хэрэгжүүлсэн үйл
            ажиллагаа, ажил хаялт, дайн, террост халдлага, гоц халдварт өвчин,
            гуравдагч байгууллагын системийн тасалдал зэрэгтэй холбоотой бол
            үйлчилгээ үзүүлэгч хариуцлага хүлээх үндэслэл болохгүй.
          </div>
          <div className="font-bold">Тав. Маргаан шийдвэрлэх</div>
          <div className="mb-4">
            5.1 Хэрэглэгч нь Үйлчилгээний нөхцөлөөр хүлээсэн үүргээ зөрчсөн,
            Үйлчилгээг хууль бусаар ашиглсан, ББСБ-н үйл ажиллагаанд болон бусад
            Хэрэглэгчдэд хохирол учруулсан нь батлагдвал Хэрэглэгчийн нэвтрэх
            эрхийг цуцлах бөгөөд холбогдох хохирлыг гаргуулна.
          </div>
          <div className="mb-4">
            5.2 Үйлчилгээтэй холбоотой санал, гомдол, асуудал, маргааныг Талууд
            эв, зүйгээр харилцан зөвшилцөх замаар шийдвэрлэнэ. Хэрэв шийдвэрлэх
            боломжгүй бол Монгол Улсын Хууль, тогтоомжид заасны дагуу
            шийдвэрлүүлнэ.
          </div>
        </div>
      </div>
      <p
        className="mt-16 mx-auto px-5 py-2.5 border text-white bg-blue-600 border-1 border-blue-600 rounded-xl cursor-pointer hover:bg-blue-200 hover:text-blue-600 duration-500 text-center w-[15%]"
        onClick={handleGo}
      >
        Үндсэн хуудас руу буцах
      </p>
    </div>
  );
};

export default Privacy;
